cookbook.org
:PROPERTIES:
#+STARTUP: overview inlineimages
#+TAGS: @baking @breakfast @entree @side @soup @stew @sauce @dressing
#+TAGS: GF(g)
#+OPTIONS: toc:nil
#+HUGO_BASE_DIR: /home/trevdev/Projects/os-cookbook/
#+HUGO_SECTION: recipe
#+HUGO_AUTO_SET_LASTMOD: t
#+HUGO_FRONT_MATTER_FORMAT: yaml
:END:
#+TITLE: Open Source Cookbook
#+AUTHOR: "Trev"
** Homemade Hoisin Sauce
:PROPERTIES:
:export_file_name: homemade-hoisin-sauce
:export_hugo_custom_front_matter: :servings 1 1/2 cup
:export_hugo_custom_front_matter+: :prep-time 10
:export_hugo_custom_front_matter+: :cook-time 0
:export_hugo_custom_front_matter+: :ready-in 10
:export_hugo_custom_front_matter+: :source-url https://www.allrecipes.com/recipe/256166/homemade-hoisin-sauce/
:END:
*** Ingredients

- 1/4 cup soy sauce
- 2 tablespoons smooth peanut butter
- 1 tablespoon dark brown sugar
- 2 teaspoons rice wine vinegar
- 2 teaspoons sesame oil
- 1 teaspoon hot sauce, or to taste
- 1 clove garlic, minced
- 1/8 teaspoon ground black pepper

*** Directions

1. Whisk soy sauce, peanut butter, brown sugar, rice wine vinegar, sesame oil, hot sauce, garlic, and black pepper together in a large bowl.

