content/recipe/homemade-hoisin-sauce.md
---
title: "Homemade Hoisin Sauce"
author: ["Trev"]
lastmod: 2022-05-30T11:03:41-07:00
categories: ["sauce"]
draft: false
servings: "1 1/2 cup"
prep-time: 10
cook-time: 0
ready-in: 10
source-url: "https://www.allrecipes.com/recipe/256166/homemade-hoisin-sauce/"
---

## Ingredients {#ingredients}

-   1/4 cup soy sauce
-   2 tablespoons smooth peanut butter
-   1 tablespoon dark brown sugar
-   2 teaspoons rice wine vinegar
-   2 teaspoons sesame oil
-   1 teaspoon hot sauce, or to taste
-   1 clove garlic, minced
-   1/8 teaspoon ground black pepper


## Directions {#directions}

1.  Whisk soy sauce, peanut butter, brown sugar, rice wine vinegar, sesame oil, hot sauce, garlic, and black pepper together in a large bowl.